Autodesk.Revit.DB.RoutingPreferenceRule.RemoveCriteron(System.Int32)
Removes an existing criterion.
index:
The index position of removed routing preference rule in the group.
Throws Autodesk.Revit.Exceptions.ArgumentException:
index is not a valid zero-based index.
-or-
Thrown if the index is out of bounds.
Since:
2013

Autodesk.Revit.DB.RoutingPreferenceRule.AddCriterion(Autodesk.Revit.DB.RoutingCriterionBase)
Adds a new routing criterion.
myCriterion:
The criterion to add.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013